<img src="./intro_images/MIE.PNG" width="100%" align="left" />

<table style="float:right;">
    <tr>
        <td>                      
            <div style="text-align: right"><a href="https://alandavies.netlify.com" target="_blank">Dr Alan Davies</a></div>
            <div style="text-align: right">Senior Lecturer health data science</div>
            <div style="text-align: right">University of Manchester</div>
         </td>
         <td>
             <img src="./intro_images/alan.PNG" width="30%" />
         </td>
     </tr>
</table>

# 5.0 Using functions
****

#### About this Notebook
This notebook introduces the use of functions in SQL for processing data.

<div class="alert alert-block alert-warning"><b>Learning Objectives:</b> 
<br/> At the end of this notebook you will be able to:
    
- Investigate and practice using inbuilt functions in SQL

- Investigate and practice aggregating data using SQL

</div>

<a id="top"></a>

<b>Table of contents</b><br>

5.1 [Group by](#group)

In this notebook we will take a look at some of the useful inbuilt SQL functions available to use. The functions available will also depend on the version of SQL you are using. As before let's make the same tables we have been using in previous examples as a starting point.

In [2]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [3]:
%%sql
DROP TABLE IF EXISTS med_data;
CREATE TABLE med_data (
    ID INTEGER NOT NULL PRIMARY KEY,
    Name VARCHAR(255),
    Age INTEGER,
    Sex CHAR,
    sys INTEGER,
    dia INTEGER,
    "Heart rate" INTEGER
);

DROP TABLE IF EXISTS drug_table;
CREATE TABLE drug_table (
    ID INTEGER NOT NULL PRIMARY KEY,
    medication VARCHAR(255),
    route VARCHAR(4), 
    "freq per day" INTEGER,
    dose VARCHAR(255),
    patient_id INTEGER,
    FOREIGN KEY(patient_id) REFERENCES med_data(ID)
);

DROP TABLE IF EXISTS medical_history;
CREATE TABLE medical_history (
    ID INTEGER NOT NULL PRIMARY KEY,
    condition VARCHAR(255),
    date_diagnosed CHAR(8), 
    patient_id INTEGER,
    FOREIGN KEY(patient_id) REFERENCES med_data(ID)
);

INSERT INTO med_data (Name, Age, Sex, sys, dia, "Heart rate") VALUES("Alan Smith", 24, "M", 120, 70, 78);
INSERT INTO med_data (Name, Age, Sex, sys, dia, "Heart rate") VALUES("Maureen Gdiver", 87, "F", 156, 82, 101);
INSERT INTO med_data (Name, Age, Sex, sys, dia, "Heart rate") VALUES("Adam Blythe", 54, "M", 132, 73, 72);
INSERT INTO med_data (Name, Age, Sex, sys, dia, "Heart rate") VALUES("Darren Sanders", 34, "M", 155, 67, 120);
INSERT INTO med_data (Name, Age, Sex, sys, dia, "Heart rate") VALUES("Sally-Ann Joyce", 19, "F", 121, 72, 65);

INSERT INTO drug_table (medication, route, "freq per day", dose, patient_id) VALUES("AMOXICILLIN", "PO", 3, "500mg", 1);
INSERT INTO drug_table (medication, route, "freq per day", dose, patient_id) VALUES("IRBESARTAN", "PO", 1, "150mg", 2);
INSERT INTO drug_table (medication, route, "freq per day", dose, patient_id) VALUES("DIGOXIN", "PO", 1, "1.5mg", 2);
INSERT INTO drug_table (medication, route, "freq per day", dose, patient_id) VALUES("SIMVASTATIN", "PO", 1, "40mg", 3);
INSERT INTO drug_table (medication, route, "freq per day", dose, patient_id) VALUES("RAMIPRIL", "PO", 1, "2.5mg", 4);
INSERT INTO drug_table (medication, route, "freq per day", dose, patient_id) VALUES("WARFARIN", "PO", 1, "variable", 4);
INSERT INTO drug_table (medication, route, "freq per day", dose, patient_id) VALUES("SENNA", "PO", 1, "15mg", 4);
INSERT INTO drug_table (medication, route, "freq per day", dose, patient_id) VALUES("None", "NA", 0, "NA", 5);

INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("LRTI", "2019-10-18 00:00:00", 1);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("Appendectomy", "2004-11-05 00:00:00", 1);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("Hypertension", "2003-12-12 00:00:00", 2);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("Atrial fibrillation", "2003-12-12 00:00:00", 2);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("#NOF", "1992-07-06 00:00:00", 2);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("Otitis media", "1990-10-18 00:00:00", 2);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("Pulmonary embolism", "1987-03-12 00:00:00", 2);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("Hypercholesterolemia", "2018-04-02 00:00:00", 3);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("Gonorrhea", "2012-06-14 00:00:00", 3);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("RTC", "1994-12-16 00:00:00", 3);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("Hypertension", "2019-08-01 00:00:00", 4);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("Constipation", "2019-04-12 00:00:00", 4);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("Atrial fibrillation", "2017-05-03 00:00:00", 4);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("CVA", "2016-12-16 00:00:00", 4);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("MI", "2014-12-12 00:00:00", 4);
INSERT INTO medical_history (condition, date_diagnosed, patient_id) VALUES("PCOS", "2016-06-08 00:00:00", 5);

 * sqlite://
Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Functions in SQL work in a similar way to Python. We call the function by typing the name of the function and then passing in any required parameters. In the case of SQL this is usually a column name. For example lets have a look at the mean (average) heart rate using the <code>avg</code> function.

In [4]:
%%sql
SELECT avg("Heart rate") FROM med_data;

 * sqlite://
Done.

[(87.2,)]

We can rename the column to make it more readable and for further reuse later using <code>AS</code> and then providing a new name. In this case <code>avg_hr</code> for average heart rate.

In [5]:
%%sql
SELECT avg("Heart rate") AS avg_hr FROM med_data;

 * sqlite://
Done.

[(87.2,)]

<div class="alert alert-block alert-info">
<b>Task 1:</b>
<br> 
Using the <code>max</code> and <code>min</code> functions. Find the maximum and minimum heart rates.
</div>

In [6]:
%%sql
SELECT min("Heart rate") FROM med_data;

 * sqlite://
Done.

[(65,)]

In [7]:
%%sql
SELECT max("Heart rate") FROM med_data;

 * sqlite://
Done.

[(120,)]

In [8]:
%%sql # type in your code below

UsageError: %%sql is a cell magic, but the cell body is empty. Did you mean the line magic %sql (single %)?

In [ ]:
%%sql # type in your code below

<div class="alert alert-block alert-info">
<b>Task 2:</b>
<br> 
Find all the heart rates above the average heart rate. Return the patients name and heart rates. <strong>Hint:</strong> you will need to use another <code>SELECT</code> statement in brackets to call the <code>avg</code> function.
</div>

In [ ]:
%%sql
SELECT Name, "Heart rate" FROM med_data WHERE "Heart rate" > (SELECT avg("Heart rate") FROM med_data);

In [ ]:
%%sql # type in your code below

These functions are often used for more complex queries built on aggregate data and for data science. This sort of approach is also used by the <code>tidyverse</code> package in <code>R</code> for sub-setting data for statistical analysis. There are also functions for dealing with dates and times as we saw earlier. A number of functions also exist for text operations, such as making all the text upper or lower case and trimming strings or finding substrings. For a list of SQLite functions have a look at this link: 
<a href="https://www.sqlite.org/lang_corefunc.html#ifnull" target="_blank">SQLite functions</a>.

<a id="group"></a>
#### 5.1 Group by

If we want to make a set of summary rows based on the values of a column or columns, we can use the <code>GROUP BY</code> command. We can then apply an aggregate function (<code>COUNT</code>, <code>SUM</code>, <code>AVG</code> etc.) for a subgroup. This is best illustrated with an example. Let's consider some hospital employee pay data.

In [10]:
%%sql
DROP TABLE IF EXISTS hospital_staff;
CREATE TABLE hospital_staff (
    ID INTEGER NOT NULL PRIMARY KEY,
    staff_name VARCHAR(255),
    staff_number CHAR(8),
    role VARCHAR(255), 
    dept_id INTEGER,
    salary INTEGER
);

INSERT INTO hospital_staff (staff_name, staff_number, role, dept_id, salary) VALUES("Rick Griffin", "342342", "General surgeon", 1, 152000);
INSERT INTO hospital_staff (staff_name, staff_number, role, dept_id, salary) VALUES("Jac Naylor", "546454", "Cardiothoracic consultant", 1, 163500);
INSERT INTO hospital_staff (staff_name, staff_number, role, dept_id, salary) VALUES("Adrian Fletcher", "437443", "Nursing manager", 1, 55000);
INSERT INTO hospital_staff (staff_name, staff_number, role, dept_id, salary) VALUES("Connie Beauchamp", "43533", "Clinical lead (ED)", 2, 155300);
INSERT INTO hospital_staff (staff_name, staff_number, role, dept_id, salary) VALUES("Donna Jackson", "342422", "Ward nurse", 1, 26300);
INSERT INTO hospital_staff (staff_name, staff_number, role, dept_id, salary) VALUES("Noel Garcia", "56443", "Receptionist", 2, 22000);
INSERT INTO hospital_staff (staff_name, staff_number, role, dept_id, salary) VALUES("Barry Smith", "342342", "Domestic", 2, 18300);
INSERT INTO hospital_staff (staff_name, staff_number, role, dept_id, salary) VALUES("Donald Givings", "546546", "Domestic", 3, 18300);

SELECT * FROM hospital_staff ORDER BY salary DESC;

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(2, 'Jac Naylor', '546454', 'Cardiothoracic consultant', 1, 163500),
 (4, 'Connie Beauchamp', '43533', 'Clinical lead (ED)', 2, 155300),
 (1, 'Rick Griffin', '342342', 'General surgeon', 1, 152000),
 (3, 'Adrian Fletcher', '437443', 'Nursing manager', 1, 55000),
 (5, 'Donna Jackson', '342422', 'Ward nurse', 1, 26300),
 (6, 'Noel Garcia', '56443', 'Receptionist', 2, 22000),
 (7, 'Barry Smith', '342342', 'Domestic', 2, 18300),
 (8, 'Donald Givings', '546546', 'Domestic', 3, 18300)]

<div class="alert alert-success">
<b>Note:</b> You might be wondering why we didn't use <code>REAL</code> or <code>DOUBLE</code> to store the currency values. In SQLite most people tend to use <code>INTEGER</code> and store prices in the lowest unit (so $1.00 becomes 100). There is often an extra field to indicate the currency value.
</div>

So here we have some hospital staff with their role, a departmental id and their salary. We can use the <code>GROUP BY</code> with the <code>max</code> function to find the top earners in each department. So here we select the fields, including the maximum salary and we group the results by the department id. We can see that <code>Jac Naylor</code> earns the most in department 1 and <code>Connie Beauchamp</code> earns the most in department 2 etc.

In [11]:
%%sql
SELECT staff_name, staff_number, role, dept_id, max(salary) 
FROM hospital_staff
GROUP BY dept_id;

 * sqlite://
Done.

[('Jac Naylor', '546454', 'Cardiothoracic consultant', 1, 163500),
 ('Connie Beauchamp', '43533', 'Clinical lead (ED)', 2, 155300),
 ('Donald Givings', '546546', 'Domestic', 3, 18300)]

We can also use the <code>HAVING</code> clause to do additional filtering. <code>WHERE</code> applies to an individual table element, where as <code>HAVING</code> is used to filter conditions based on groups. So here we do the same query but add an additional constraint to make sure there has to be more than 1 member of staff in a given department to find the highest earner.

In [12]:
%%sql
SELECT staff_name, staff_number, role, dept_id, max(salary) 
FROM hospital_staff
GROUP BY dept_id
HAVING COUNT(*) > 1;

 * sqlite://
Done.

[('Jac Naylor', '546454', 'Cardiothoracic consultant', 1, 163500),
 ('Connie Beauchamp', '43533', 'Clinical lead (ED)', 2, 155300)]

<div class="alert alert-block alert-info">
<b>Task 3:</b>
<br> 
1. Modifying the initial query above, find the smallest salary for each departmental group.<br />
2. Find the total salary of all employees in the <code>hospital_staff</code> table.
</div>

In [13]:
%%sql
SELECT staff_name, staff_number, role, dept_id, min(salary) 
FROM hospital_staff
GROUP BY dept_id;

 * sqlite://
Done.

[('Donna Jackson', '342422', 'Ward nurse', 1, 26300),
 ('Barry Smith', '342342', 'Domestic', 2, 18300),
 ('Donald Givings', '546546', 'Domestic', 3, 18300)]

In [17]:
%%sql
SELECT sum(salary) AS Total FROM hospital_staff

 * sqlite://
Done.

[(610700,)]

In [ ]:
%%sql # type in your code below

In [ ]:
%%sql # type in your code below

<div class="alert alert-block alert-info">
<b>Task 4:</b>
<br> 
Convert all the staff names in the <code>hospital_staff</code> table to upper case (capital letters). <strong>Hint:</strong> You might need to look at the list of functions presented earlier (<a href="https://www.sqlite.org/lang_corefunc.html#ifnull" target="_blank">SQLite functions</a>). Also remember you need to update the tables contents with <code>UPDATE</code>. 
</div>

In [18]:
%%sql
UPDATE hospital_staff SET staff_name = upper(staff_name);
SELECT * FROM hospital_staff;

 * sqlite://
8 rows affected.
Done.

[(1, 'RICK GRIFFIN', '342342', 'General surgeon', 1, 152000),
 (2, 'JAC NAYLOR', '546454', 'Cardiothoracic consultant', 1, 163500),
 (3, 'ADRIAN FLETCHER', '437443', 'Nursing manager', 1, 55000),
 (4, 'CONNIE BEAUCHAMP', '43533', 'Clinical lead (ED)', 2, 155300),
 (5, 'DONNA JACKSON', '342422', 'Ward nurse', 1, 26300),
 (6, 'NOEL GARCIA', '56443', 'Receptionist', 2, 22000),
 (7, 'BARRY SMITH', '342342', 'Domestic', 2, 18300),
 (8, 'DONALD GIVINGS', '546546', 'Domestic', 3, 18300)]

In [ ]:
%%sql # type in your code below

In the final notebook we will consider how we can combine SQL with Python. You will frequently see systems written in a modern programming language such as Python that connect to a back end relational database. As this is a common situation there are many libraries that have been created to support this activity in the various programming languages.

### Notebook details
<br>
<i>Notebook created by <strong>Dr. Alan Davies</strong> 

Publish date: March 2021<br>
Review date: March 2022</i>

Please give your feedback using the button below:

<a class="typeform-share button" href="https://hub11.typeform.com/to/Cx87HtZ7" data-mode="popup" style="display:inline-block;text-decoration:none;background-color:#3A7685;color:white;cursor:pointer;font-family:Helvetica,Arial,sans-serif;font-size:18px;line-height:45px;text-align:center;margin:0;height:45px;padding:0px 30px;border-radius:22px;max-width:100%;white-space:nowrap;overflow:hidden;text-overflow:ellipsis;font-weight:bold;-webkit-font-smoothing:antialiased;-moz-osx-font-smoothing:grayscale;" target="_blank">Rate this notebook </a> <script> (function() { var qs,js,q,s,d=document, gi=d.getElementById, ce=d.createElement, gt=d.getElementsByTagName, id="typef_orm_share", b="https://embed.typeform.com/"; if(!gi.call(d,id)){ js=ce.call(d,"script"); js.id=id; js.src=b+"embed.js"; q=gt.call(d,"script")[0]; q.parentNode.insertBefore(js,q) } })() </script>

## Notes: